-- $Name: Стул$
-- $Version: 0.1$

instead_version "1.5.3"

game.act = 'Не получается.';
game.inv = 'Гм.. Странная штука..';
game.use = 'Не сработает...';

main = room {
	nam = 'Стул',
	dsc = [[Версия 0.1^^
	Игра сделана в рамках скринкаста "INSTEAD для создателей игр".]],
	obj = {vway('начать', '{Начать}', 'begin')},
	--way = {'begin'},
}

begin = room {
	nam = 'Утро...',
	dsc = [[Это было одним весенним утром. Я проснулся в 6 часов...^^
	Дома никого не было.]],
	obj = {vway('продолжить', '{Продолжить}', 'gg_room')},
	--way = {'gg_room'},
}

gg_room = room {
	nam = 'Моя комната',
	dsc = [[Я стою в своей комнате. Утро...^^
	Нужно одеться.]],
	act = function(s, w)
		if w == 'картина' then
			p 'Это старая картина. На ней изображено дерево.';
		elseif w == 'шкаф' then
			p 'Деревенянный шкаф.';
		end
	end,
	obj = {'stul',
		vobj('картина', 'На стене висит {картина}.'),
		vobj('шкаф', 'В углу стоит {шкаф}.')},
	way = {'coridore'},
}

stul = obj {
	nam = 'Стул',
	dsc = [[В углу комнаты стоит {стул}.]],
	act = [[Это старый деревянный стул. Он достался мне от бабушки.]],
	obj = {'dress'},
}

dress = obj {
	nam = 'Одежда',
	dsc = [[На стуле лежит {моя одежда}: футболка и шорты.]],
	tak = [[Я оделся.]],
	inv = [[Моя одежда: футболка, шорты.]],
	use = function(s, w)
		if w == stul then
			inv():del(s);
			stul.obj:add(s);
			p 'Я положил одежду обратно.';
		else
			p 'Сюда одежду лучше не ложить.';
		end
	end,
}

coridore = room {
	nam = 'Коридор',
	dsc = [[Небольшой коридор.]],
	way = {'gg_room', 'zal'},
}

zal = room {
	nam = 'Зал',
	dsc = [[Зал]],
	way = {'coridore'},
}
